Revit 2027 API
BuiltInFailures.CurtainWallFailures.NegativeBeltDistance Property
 Measurement Line Offset cannot be negative.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NegativeBeltDistance { get; }
Public Shared ReadOnly Property NegativeBeltDistance As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NegativeBeltDistance {
	FailureDefinitionId^ get ();
}
static member NegativeBeltDistance : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurtainWallFailures Class
Autodesk.Revit.DB Namespace